from juba import Ner
from juba import ForwordFitting
text='据新华社12月14日报道，中共中央总书记、国家主席、中央军委主席习近平将于12月18日至20日赴澳门，出席庆祝澳门回归祖国20周年大会暨澳门特别行政区第五届政府就职典礼，并视察澳门特别行政区。'
print(Ner(text))

data = [47.06,36.17,32.31,44.61,46.1,48.07,52.13,56.05,59.34,50.88,48.76,45.21,45.02,29.76,39.81,46.19,47.09,53.56,54.32,58.16,61.04,53.85,50.23,42.14,51.01,44.25,26.21,46.67,47.67,58.59,63.33,62.87,57.99,53.09,50.46,50.6,39.8,34.12,51.2,50.95,58.2,63.31,70.87,68.62,64.08,56.73,51.17,51.92,50.66]
F = ForwordFitting(periodic_factor=len(data), complexity=30)
F.fit(sequence=data)
F.predict(pred_step=5)
print(F.fit_original_data())